<?php

use Illuminate\Database\Seeder;

class RolesTableSeeder extends Seeder
{

    /**
     * Auto generated seed file
     *
     * @return void
     */
    public function run()
    {
        

        \DB::table('roles')->delete();
        
        \DB::table('roles')->insert(array (
            0 => 
            array (
                'id' => 1,
                'title' => 'អ្នកគ្រប់គ្រងប្រព័ន្ធ',
                'name' => 'super',
                'created_at' => '2017-04-04 03:30:33',
                'updated_at' => '2017-07-07 12:53:41',
                'note' => NULL,
            ),
            1 => 
            array (
                'id' => 2,
                'title' => 'រដ្ឋបាល',
                'name' => 'admin',
                'created_at' => '2017-04-04 03:31:11',
                'updated_at' => '2017-07-07 12:53:48',
                'note' => NULL,
            ),
            2 => 
            array (
                'id' => 3,
                'title' => 'អ្នកត្រួតពិនិត្យ',
                'name' => 'auditor',
                'created_at' => '2017-04-04 03:31:44',
                'updated_at' => '2017-07-07 12:53:59',
                'note' => NULL,
            ),
            3 => 
            array (
                'id' => 4,
                'title' => 'អ្នកបញ្ចូលទិន្នន័យ',
                'name' => 'data',
                'created_at' => '2017-04-04 03:32:14',
                'updated_at' => '2017-07-11 06:02:39',
                'note' => 'អ្នកបញ្ចូលទិន្នន័យ ជាតួនាទី ដែលអាចប្រើប្រព័ន្ធក្នុងព្រំដែន 
១. អាចបញ្ចូលឯកសារ ចូលប្រព័ន្ធ 
២. ស្វែងរក ឯកសារ ដែលមានខ្លួនបានបញ្ចូល
៣. បញ្ជូនទៅផ្នែកត្រួតពិនិត្យ   
សូមពិនិត្យមើលការកំណត់ខាងលើ ក្នុងផ្នែកសិទ្ធិ។',
            ),
            4 => 
            array (
                'id' => 5,
                'title' => 'អ្នកទស្សនា',
                'name' => 'visitor',
                'created_at' => '2017-04-04 03:32:14',
                'updated_at' => '2017-07-11 05:40:33',
                'note' => 'អ្នកទស្សនា ជាតួនាទី ដែលអាចប្រើប្រព័ន្ធក្នុងព្រំដែន ស្វែងរក ឯកសារ ដែលមានលក្ខណៈ ជាសារធារណៈ ។
សម្រាប់មុខងាលម្អិតរបស់ អ្នកទស្សនា ។ សូមពិនិត្យមើលការកំណត់ខាងលើ ក្នុងផ្នែកសិទ្ធិ។',
            ),
            5 => 
            array (
                'id' => 6,
                'title' => 'ក្រសួង/ស្ថាប័ន/អង្គភាព',
                'name' => 'unit',
                'created_at' => '2017-07-11 05:31:51',
                'updated_at' => '2017-07-11 05:36:40',
                'note' => 'តួនាទីនេះ ប្រើសម្រាប់គ្រប់គ្រង អង្គភាព ឬ ស្ថាប័ន ឬ ក្រសួង។
ដែលនិង មាន តួនាទីផ្សេងៗទៀតនៅពីក្រោម។',
            ),
        ));
        
        
    }
}